project/src/InformationRegisters/НастройкиОграниченияДоступаККонвертациям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОграниченияДоступаККонвертациям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Конвертация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конвертации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

project/src/Enums/СостоянияПравил.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СостоянияПравил</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаТестировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

project/src/Enums/РазделыДополнительныхМодулей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>РазделыДополнительныхМодулей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Алгоритмы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыОтправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыПолучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользовательский</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееОтправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПолучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Базисный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

project/src/Catalogs/ПравилаКонвертацииСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ПравилаКонвертацииСвойств</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ПравилаКонвертацииОбъектов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяАлгоритмКонвертации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяСвойстваКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяСвойстваФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоКонвертацииСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоКонфигурацииСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвойстваКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвойстваФормата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойствоКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Свойства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойствоКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСвойстваКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучитьИзВходящихДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриВыгрузкеСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОбработкойВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеОбработкиВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поиск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЗамещать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПриводитьЗначениеКДлинеПриемника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПараметраДляПередачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоискПоДатеНаРавенство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьГруппуЧерезФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяСвойстваКонфигурацииКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/Релизы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Релизы</Name>
			<Comment>Релизы конфигураций</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресGitСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗагрузкиДвижений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРасширения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВеткиРепозитория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогGitРепозитория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонфигурацияВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьМетаданныеПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Приложения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗаданиеGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расширения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКаталогаЗагрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/ДополнительныеМодули.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ДополнительныеМодули</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Конвертации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РазделыДополнительныхМодулей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/Catalogs/СоставыКонвертаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СоставыКонвертаций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Конвертации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭлементКонвертации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаКонвертацииПредопределенныхДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаКонвертацииОбъектов</v8:Type>
						<v8:Type>cfg:CatalogRef.Алгоритмы</v8:Type>
						<v8:Type>cfg:CatalogRef.Запросы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбработкиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/CommonModules/КонвертацияДанныхXDTOСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс
// Установка монопольного режима для целей отключения базы от главного узла.
// Параметры:
//   Отказ - Булево - признак отказа.
Процедура УстановитьМонопольныйРежимДляОтключенияДемоБазыОтГлавногоУзла(Отказ = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыОбмена.Полный.ЭтотУзел(), "ДляПубликации")
		И ЗначениеЗаполнено(ПланыОбмена.ГлавныйУзел()) Тогда
		
		Если НЕ МонопольныйРежим() Тогда
			Попытка
				УстановитьМонопольныйРежим(Истина);
			Исключение
				Отказ = Истина;
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Отключение базы от главного узла в случае необходимости.
Процедура ОтключитьДемонстрационнуюБазуОтГлавногоУзлаПриНеобходимости() Экспорт
	
	Если ЗначениеЗаполнено(ПланыОбмена.ГлавныйУзел())
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПланыОбмена.Полный.ЭтотУзел(), "ДляПубликации") Тогда
		
		ПланыОбмена.УстановитьГлавныйУзел(Неопределено);
		Константы.НастройкаПодчиненногоУзлаРИБЗавершена.Установить(Истина);
		
		Если МонопольныйРежим() Тогда
			Попытка
				УстановитьМонопольныйРежим(Ложь);
			Исключение
				Возврат;
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру параметров, необходимых для работы клиентского кода.
// при запуске конфигурации, т.е. в обработчиках событий.
// - ПередНачаломРаботыСистемы.
// - ПриНачалеРаботыСистемы.
//
// Важно: при запуске недопустимо использовать команды сброса кэша.
// повторно используемых модулей, иначе запуск может привести.
// к непредсказуемым ошибкам и лишним серверным вызовам.
//
// Параметры:
//   Параметры - Структура - (возвращаемое значение) структура параметров работы клиента при запуске.
//
Процедура ПараметрыРаботыКлиентаПриЗапуске(Параметры) Экспорт
	ПоказатьПомощникБыстрогоОсвоения = ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных()
		И ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ПомощникБыстрогоОсвоения", "Показывать", Истина);
	Параметры.Вставить("ПоказатьПомощникБыстрогоОсвоения", ПоказатьПомощникБыстрогоОсвоения);

КонецПроцедуры

// Раскладывает строковое представление простого типа на составляющие для отображения в формах
// Параметры:
//   ПредставлениеТипа - Строка - полное представление типа.
//   ДляВыгрузкиФормата - Булево - Признак, для чего вызывается функция. 
//   Тип - Строка - Тип строкой.
//   Длина - Строка - Длина в типе.
//   Точность - Строка - Точность в типе.
//   МинимальнаяДлинаСтроки - Строка - мин. длина строки.
//   НеограниченнаяДлина - Булево - признак неограниченной длины.
Процедура РазложитьПредставлениеПростогоТипа(ПредставлениеТипа, ДляВыгрузкиФормата, Тип, Длина, Точность, МинимальнаяДлинаСтроки, НеограниченнаяДлина) Экспорт
	Если Найти(ПредставлениеТипа, "datetime") Тогда
		Тип = ?(ДляВыгрузкиФормата, "dateTime","Дата");
	ИначеЕсли Найти(ПредставлениеТипа, "date") Тогда
		Тип = ?(ДляВыгрузкиФормата, "date","Дата");
	ИначеЕсли Найти(ПредставлениеТипа, "boolean") Тогда
		Тип = ?(ДляВыгрузкиФормата, "boolean", "Булево");
	ИначеЕсли Найти(ПредставлениеТипа, "string") Тогда
		Тип = ?(ДляВыгрузкиФормата, "string", "Строка");
	ИначеЕсли Найти(ПредставлениеТипа, "int") Тогда
		Если ДляВыгрузкиФормата Тогда
			Тип = ?(Найти(ПредставлениеТипа, "integer") > 0, "integer", "int");
		Иначе
			Тип = "Число";
		КонецЕсли;
		ДлинаБезДесятых(ПредставлениеТипа, Длина);
		Точность = 0;
	ИначеЕсли Найти(ПредставлениеТипа, "decimal") Тогда
		Тип = ?(ДляВыгрузкиФормата, "decimal", "Число");
	Иначе
		Если ДляВыгрузкиФормата Тогда
			Тип = СокрЛП(ПредставлениеТипа);
		Иначе
			Тип = "Прочее";
		КонецЕсли;
	КонецЕсли;
	Если Найти(ПредставлениеТипа, "string") ИЛИ Найти(ПредставлениеТипа, "decimal") Тогда
		ПозицияСкобки1 = Найти(ПредставлениеТипа, "(");
		ПозицияСкобки2 = Найти(ПредставлениеТипа, ")");
		ПозицияЗапятой = Найти(ПредставлениеТипа, ",");
		Длина = 0;
		Если ПозицияСкобки1 > 0 И ПозицияСкобки2 > 0 Тогда
			Если ПозицияЗапятой = 0 Тогда
				Точность = 0;
				ДлинаБезДесятых(ПредставлениеТипа, Длина);
			Иначе
				ДлинаСтрокой = Сред(ПредставлениеТипа, ПозицияСкобки1 + 1, ПозицияЗапятой - ПозицияСкобки1 - 1);
				Длина1 = Число(ДлинаСтрокой);
				
				ДлинаСтрокой = Сред(ПредставлениеТипа, ПозицияЗапятой + 1, ПозицияСкобки2 - ПозицияЗапятой - 1);
				Длина2 = Число(ДлинаСтрокой);
				Если Найти(ПредставлениеТипа, "string") Тогда
					МинимальнаяДлинаСтроки = Длина1;
					Длина = Длина2;
				Иначе
					Длина = Длина1;
					Точность = Длина2;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Длина = 0 И Найти(ПредставлениеТипа, "string") Тогда
			НеограниченнаяДлина = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Возвращает версию формата менеджера обмена.
// Параметры:
//  Конвертация - СправочникСсылка.Конвертации - ссылка на конвертацию.
// Возвращаемое значение:
//  Число - номер версии.
Функция ВерсияФорматаМенеджераОбмена(Конвертация) Экспорт
	Если ЗначениеЗаполнено(Конвертация) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Конвертация, "ВерсияФорматаМенеджера");
	КонецЕсли;
	// Если конвертация пустая, возвращается максимально возможная версия.
	Возврат "2";
КонецФункции

// Проверяет возможность изменения статуса у Конвертации или Регистрации.
// Параметры:
//  ОбъектСсылка - СправочникСсылка.Конвертации, СправочникСсылка.Регистрации - ссылка на объект.
//  СтатусНовый - ПеречислениеСсылка.СостоянияПравил - новый статус объекта
//  Отказ - Булево - признак отказа
Процедура ПроверитьВозможностьИзмененияСтатуса(ОбъектСсылка, СтатусНовый, Отказ) Экспорт
	Если Константы.СовместнаяРабота.Получить() = Ложь Тогда
		// Проверки не требуются
		Возврат;
	КонецЕсли;
	// Выясним текущий статус.
	СтатусСтарый = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектСсылка, "Статус");
	Если СтатусСтарый = СтатусНовый
		Или СтатусСтарый = Перечисления.СостоянияПравил.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
	Если СтатусСтарый = Перечисления.СостоянияПравил.Архив Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Изменение текущего статуса Архив не предусмотрено.'"));
		Возврат;
	КонецЕсли;
	КорректныеСтатусы = Новый Массив;
	Если СтатусСтарый = Перечисления.СостоянияПравил.ВРаботе Тогда
		КорректныеСтатусы.Добавить(Перечисления.СостоянияПравил.НаТестировании);
	ИначеЕсли СтатусСтарый = Перечисления.СостоянияПравил.Черновик Тогда
		КорректныеСтатусы.Добавить(Перечисления.СостоянияПравил.ВРаботе);
	ИначеЕсли СтатусСтарый = Перечисления.СостоянияПравил.НаТестировании Тогда
		КорректныеСтатусы.Добавить(Перечисления.СостоянияПравил.ВРаботе);
		КорректныеСтатусы.Добавить(Перечисления.СостоянияПравил.Готово);
	ИначеЕсли СтатусСтарый = Перечисления.СостоянияПравил.Готово Тогда
		КорректныеСтатусы.Добавить(Перечисления.СостоянияПравил.ВРаботе);
		КорректныеСтатусы.Добавить(Перечисления.СостоянияПравил.Архив);
	КонецЕсли;
	Если КорректныеСтатусы.Найти(СтатусНовый) = Неопределено Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru='Новый статус %1 выбран некорректно. Из статуса %2 возможен переход к статусу %3'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, СтатусНовый, СтатусСтарый, СтрСоединить(КорректныеСтатусы,","));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

// Формирование записи регистра об изменении статуса Регистрации или Конвертации.
// Параметры:
//  Ссылка - СправочникСсылка.Конвертации, СправочникСсылка.Регистрации - ссылка на объект.
//  Статус - ПеречислениеСсылка.СостоянияПравил - новый статус объекта
Процедура ОтразитьИзмененияСтатуса(Ссылка, Статус) Экспорт
	Если Константы.СовместнаяРабота.Получить() = Ложь Тогда
		// Изменения не требуются
		Возврат;
	КонецЕсли;
	// Проверка требуется ли менять статус.
	СвежийСтатус = РегистрыСведений.СтатусыПравил.СрезПоследних(ТекущаяДатаСеанса(), Новый Структура("Объект", Ссылка));
	Если СвежийСтатус.Количество() > 0 И СвежийСтатус[0].Статус = Статус Тогда
		Возврат;
	КонецЕсли;
	РегистрСтатусыЗапись = РегистрыСведений.СтатусыПравил.СоздатьМенеджерЗаписи();
	РегистрСтатусыЗапись.Объект = Ссылка;
	РегистрСтатусыЗапись.Период = ТекущаяДатаСеанса();
	РегистрСтатусыЗапись.Статус = Статус;
	РегистрСтатусыЗапись.Активность = Истина;
	РегистрСтатусыЗапись.Записать();
КонецПроцедуры

// Получает сведения о пользователе, захватившем объект. 
// Вызывается в процедурах ПриСозданииНаСервере и управляет доступностью формы для редактирования.
// Параметры:
//   СправочникОбъект - СправочникОбъект - справочник, который проверяется
//   ФормаСправочника - УправляемаяФорма - форма, которая будет открыта.
//   РодительскийОбъект - СправочникСсылка.ПравилаКонвертацииОбъектов - в случае работы с ПКС владелец ПКС.
Процедура ПрочитатьСведенияОЗахватеОбъекта(СправочникОбъект, ФормаСправочника, РодительскийОбъект = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Пользователь
	|ИЗ РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(, Объект = &Ссылка)
	|ГДЕ Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ Пользователь
	|ИЗ РегистрСведений.СовместнаяРаботаСОбъектами
	|ГДЕ Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват) И РабочаяКопия = &Ссылка
	|";
	Если РодительскийОбъект <> Неопределено Тогда
		// Вызов из формы ПКС, признак захвата ставится у владельца
		Запрос.УстановитьПараметр("Ссылка", РодительскийОбъект);
	Иначе
		Запрос.УстановитьПараметр("Ссылка", СправочникОбъект.Ссылка);
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗахваченТекущимПользователем = (Выборка.Пользователь = Пользователи.ТекущийПользователь());
		ФормаСправочника.ТолькоПросмотр = НЕ ЗахваченТекущимПользователем;
	ИначеЕсли РодительскийОбъект = Неопределено И СправочникОбъект.Захвачен Тогда
		// Рассогласованы данные регистра и данные объекта.
		СправочникОбъект.Захвачен = Ложь;
	КонецЕсли;
КонецПроцедуры

// Снимает захват с объектов - правил конвертации и/или регистрации.
// Параметры:
//   ОбъектДляОбработки - СправочникСсылка - ссылка на элементы справочника, с которых снимается захват
//   Действие - ПеречислениеСсылка.ДействияПриСовместнойРаботе - ОтменаЗахвата или ЗаписьОбъекта.
//   Комментарий - Строка - Описание внесенных изменений в случае сохранения изменений.
//   ВыполненоУспешно - Булево - признак успешного выполнения действия.
Процедура СнятьЗахватСОбъекта(ОбъектДляОбработки, Действие, Комментарий, ВыполненоУспешно) Экспорт
	// Находим запись о захвате.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	|	РабочаяКопия
	|ИЗ РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(,Объект = &СсылкаНаОбъект)
	|ГДЕ Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)
	|";
	Запрос.УстановитьПараметр("СсылкаНаОбъект", ОбъектДляОбработки);
	Выборка = Запрос.Выполнить().Выбрать();
	ИсходныйОбъектСсылка = Неопределено;
	Если Выборка.Следующий() Тогда
		ИсходныйОбъектСсылка = Выборка.РабочаяКопия;
	КонецЕсли;
	// Исходного объекта может не быть, если захвачен новый объект. Тогда возможна только запись.
	Если ИсходныйОбъектСсылка = Неопределено И Действие = Перечисления.ДействияПриСовместнойРаботе.ОтменаЗахвата Тогда
		ВыполненоУспешно = Ложь;
		ТекстСообщения = НСтр("ru='Не удалось отменить захват объекта:'") + " " + ОбъектДляОбработки + Символы.ПС + НСтр("ru='Не обнаружена первоначальная копия захваченного объекта'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ОбъектДляОбработки);
		Возврат;
	КонецЕсли;
	// Проверка не заблокирован ли исходный объект.
	Если ИсходныйОбъектСсылка <> Неопределено Тогда
		Попытка
			ИсходныйОбъект = ИсходныйОбъектСсылка.ПолучитьОбъект();
			ИсходныйОбъект.Заблокировать();
		Исключение
			ВыполненоУспешно = Ложь;
			ТекстСообщения = НСтр("ru='Не удалось отменить захват объекта:'") + " " + ОбъектДляОбработки + Символы.ПС + НСтр("ru='Не удалось заблокировать копию захваченного объекта'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ОбъектДляОбработки);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	СвойстваИсключаемые = Новый Соответствие();
	ТЧПереносимые = Новый Соответствие();

	НачатьТранзакцию();
	Попытка
		ИзмененныйОбъект = ОбъектДляОбработки.ПолучитьОбъект();
		КопииПКС = Новый Массив;
		Если ТипЗнч(ИсходныйОбъектСсылка) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	Ссылка
			|ИЗ Справочник.ПравилаКонвертацииСвойств
			|ГДЕ Владелец = &ИсходноеПКО И НЕ ПометкаУдаления
			|УПОРЯДОЧИТЬ ПО ЭтоГруппа УБЫВ";
			Запрос.УстановитьПараметр("ИсходноеПКО", ИсходныйОбъектСсылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				КопииПКС.Добавить(Выборка.Ссылка);
			КонецЦикла; 
		КонецЕсли;
		Если Действие = Перечисления.ДействияПриСовместнойРаботе.ЗаписьОбъекта Тогда
			// Снятие признака захвата у измененного объекта.
			ИзмененныйОбъект.Захвачен = Ложь;
			ИзмененныйОбъект.ОбменДанными.Загрузка = Истина;
			ИзмененныйОбъект.ДополнительныеСвойства.Вставить("ВерсионированиеОбъектовКомментарийКВерсии", Комментарий);
			ИзмененныйОбъект.Записать();
			ИзмененныйОбъект.ОбменДанными.Загрузка = Ложь;
			ВерсионированиеОбъектов.ЗаписатьВерсиюОбъекта(ИзмененныйОбъект, Ложь);
			
			Если ИсходныйОбъектСсылка <> Неопределено Тогда
				// Удаление исходной копии объекта.
				УдалитьЗаписьСоставКонвертации(ИсходныйОбъект.Ссылка);
				ИсходныйОбъект.ОбменДанными.Загрузка = Истина;
				ИсходныйОбъект.Удалить();
				// Удаление ПКС исходной копии.
				Для Каждого КопияПКС Из КопииПКС Цикл
					ПКСОбъект = КопияПКС.ПолучитьОбъект();
					ПКСОбъект.ОбменДанными.Загрузка = Истина;
					ПКСОбъект.Удалить();
				КонецЦикла;
				
				// Корректировка записи о захвате в регистре.
				ЗаписьОЗахвате = РегистрыСведений.СовместнаяРаботаСОбъектами.СоздатьНаборЗаписей();
				ЗаписьОЗахвате.Отбор.Объект.Установить(ОбъектДляОбработки);
				ЗаписьОЗахвате.Отбор.Действие.Установить(Перечисления.ДействияПриСовместнойРаботе.Захват);
				ЗаписьОЗахвате.Прочитать();
				Для Каждого ТекущаяЗапись Из ЗаписьОЗахвате Цикл
					ТекущаяЗапись.РабочаяКопия = Неопределено;
				КонецЦикла;
				ЗаписьОЗахвате.Записать(Истина);
			КонецЕсли;
			
			// Добавление записи о заливке объекта.
			ПараметрыЗаписи = Новый Структура("Пользователь, Объект, Действие",
				Пользователи.ТекущийПользователь(), ОбъектДляОбработки, 
				Перечисления.ДействияПриСовместнойРаботе.ЗаписьОбъекта);
			ПараметрыЗаписи.Вставить("Комментарий", Комментарий);
			ДобавитьЗаписьЗахватОбъекта(ПараметрыЗаписи);
		Иначе
			
			// Копирование реквизитов рабочей копии в измененный объект.
			ИсключаемыеСвойстваСтрокой = "";
			МассивТЧ = Новый Массив;
			ПолучитьТЧИСвойстваИсключаемые(ОбъектДляОбработки, СвойстваИсключаемые, ИсключаемыеСвойстваСтрокой, МассивТЧ);
			ЗаполнитьЗначенияСвойств(ИзмененныйОбъект, ИсходныйОбъект,,ИсключаемыеСвойстваСтрокой);
			Для Каждого ИмяТЧ Из МассивТЧ Цикл
				ИзмененныйОбъект[ИмяТЧ].Загрузить(ИсходныйОбъект[ИмяТЧ].Выгрузить());
			КонецЦикла;
			Если ТипЗнч(ОбъектДляОбработки) = Тип("СправочникСсылка.ПравилаРегистрацииОбъектов") 
				И НЕ ИзмененныйОбъект.ЭтоГруппа Тогда
				// Реквизиты типа Хранилище значения.
				ИзмененныйОбъект.ОтборПоСвойствамОбъекта = Новый ХранилищеЗначения(ИсходныйОбъект.ОтборПоСвойствамОбъекта.Получить());
				ИзмененныйОбъект.ОтборПоСвойствамПланаОбмена = Новый ХранилищеЗначения(ИсходныйОбъект.ОтборПоСвойствамПланаОбмена.Получить());
			КонецЕсли;
			ИзмененныйОбъект.Копия = Ложь;
			ИзмененныйОбъект.Захвачен = Ложь;
			ИзмененныйОбъект.ОбменДанными.Загрузка = Истина;
			ИзмененныйОбъект.Записать();
			ИзмененныйОбъект.ОбменДанными.Загрузка = Ложь;
			ВерсионированиеОбъектов.ЗаписатьВерсиюОбъекта(ИзмененныйОбъект, Ложь);
			
			// Перенос сведений из правил конвертации свойств.
			Если ТипЗнч(ОбъектДляОбработки) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
				ТекстЗапросаДляПоискаЭлемента = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	Ссылка
				|ИЗ Справочник.ПравилаКонвертацииСвойств
				|ГДЕ Владелец = &ИзмененноеПКО 
				|	И ПолноеИмяСвойстваКонфигурации = &ПолноеИмяСвойстваКонфигурации
				|	И ПолноеИмяСвойстваФормата = &ПолноеИмяСвойстваФормата
				|	И ПолноеИмяСвойстваКонфигурацииКорреспондента = &ПолноеИмяСвойстваКонфигурацииКорреспондента
				|	И ИмяПараметраДляПередачи = &ИмяПараметраДляПередачи
				|	И СвойствоКонфигурации = &СвойствоКонфигурации
				|	И СвойствоФормата = &СвойствоФормата
				|	И СвойствоКонфигурацииКорреспондента = &СвойствоКонфигурацииКорреспондента
				|	И ЭтоГруппа = ЛОЖЬ";
				
				ТекстЗапросаДляПоискаГруппы = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	Ссылка
				|ИЗ Справочник.ПравилаКонвертацииСвойств
				|ГДЕ Владелец = &ИзмененноеПКО 
				|	И СвойствоКонфигурации = &СвойствоКонфигурации
				|	И СвойствоФормата = &СвойствоФормата
				|	И СвойствоКонфигурацииКорреспондента = &СвойствоКонфигурацииКорреспондента
				|	И ЭтоГруппа = ИСТИНА";

				ОбновленныеПКС = Новый Массив;
				СоответствиеГрупп = Новый Соответствие;
				// Сортировка такая что сначала обрабатываются группы, затем элементы.
				Для Каждого ПКС Из КопииПКС Цикл
					ЭтоГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПКС, "ЭтоГруппа");
					Запрос = Новый Запрос;
					Запрос.УстановитьПараметр("ИзмененноеПКО", ОбъектДляОбработки);
					Если ЭтоГруппа Тогда
						ПараметрыТекущегоПКС = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПКС, 
							"СвойствоКонфигурации, СвойствоФормата, СвойствоКонфигурацииКорреспондента, Родитель");
						Запрос.Текст = ТекстЗапросаДляПоискаГруппы;
						Запрос.УстановитьПараметр("СвойствоКонфигурации", ПараметрыТекущегоПКС.СвойствоКонфигурации);
						Запрос.УстановитьПараметр("СвойствоФормата", ПараметрыТекущегоПКС.СвойствоФормата);
						Запрос.УстановитьПараметр("СвойствоКонфигурацииКорреспондента", ПараметрыТекущегоПКС.СвойствоКонфигурацииКорреспондента);
					Иначе
						ПараметрыТекущегоПКС = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПКС, 
							"СвойствоКонфигурации, СвойствоФормата, СвойствоКонфигурацииКорреспондента," 
							+ "ПолноеИмяСвойстваКонфигурации, ПолноеИмяСвойстваФормата, "
							+ "ПолноеИмяСвойстваКонфигурацииКорреспондента, ИмяПараметраДляПередачи, Родитель");
						Запрос.Текст = ТекстЗапросаДляПоискаЭлемента;
						Запрос.УстановитьПараметр("ПолноеИмяСвойстваКонфигурации", ПараметрыТекущегоПКС.ПолноеИмяСвойстваКонфигурации);
						Запрос.УстановитьПараметр("ПолноеИмяСвойстваФормата", ПараметрыТекущегоПКС.ПолноеИмяСвойстваФормата);
						Запрос.УстановитьПараметр("ПолноеИмяСвойстваКонфигурацииКорреспондента", ПараметрыТекущегоПКС.ПолноеИмяСвойстваКонфигурацииКорреспондента);
						Запрос.УстановитьПараметр("ИмяПараметраДляПередачи", ПараметрыТекущегоПКС.ИмяПараметраДляПередачи);
						Запрос.УстановитьПараметр("СвойствоКонфигурации", ПараметрыТекущегоПКС.СвойствоКонфигурации);
						Запрос.УстановитьПараметр("СвойствоФормата", ПараметрыТекущегоПКС.СвойствоФормата);
						Запрос.УстановитьПараметр("СвойствоКонфигурацииКорреспондента", ПараметрыТекущегоПКС.СвойствоКонфигурацииКорреспондента);
					КонецЕсли;
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						ОбновленныеПКС.Добавить(Выборка.Ссылка);
						ПКСДляЗаполнения = Выборка.Ссылка.ПолучитьОбъект();
					Иначе
						Если ЭтоГруппа Тогда
							ПКСДляЗаполнения = Справочники.ПравилаКонвертацииСвойств.СоздатьГруппу();
						Иначе
							ПКСДляЗаполнения = Справочники.ПравилаКонвертацииСвойств.СоздатьЭлемент();
						КонецЕсли;
						ПКСДляЗаполнения.Владелец = ОбъектДляОбработки;
					КонецЕсли;
					ИсключаемыеСвойстваСтрокой = "";
					МассивТЧ = Новый Массив;
					ПолучитьТЧИСвойстваИсключаемые(ПКС, СвойстваИсключаемые, ИсключаемыеСвойстваСтрокой, МассивТЧ);
					Если ПустаяСтрока(ИсключаемыеСвойстваСтрокой) Тогда
						ИсключаемыеСвойстваСтрокой = "Родитель, Владелец";
					Иначе
						ИсключаемыеСвойстваСтрокой = ИсключаемыеСвойстваСтрокой + ", Родитель, Владелец";
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(ПКСДляЗаполнения, ПКС,,ИсключаемыеСвойстваСтрокой);
					Если ЗначениеЗаполнено(ПараметрыТекущегоПКС.Родитель)
						И НЕ ЗначениеЗаполнено(ПКСДляЗаполнения.Родитель) Тогда
						ПКСДляЗаполнения.Родитель = СоответствиеГрупп.Получить(ПараметрыТекущегоПКС.Родитель); 
					КонецЕсли;
					ПКСДляЗаполнения.ОбменДанными.Загрузка = Истина;
					ПКСДляЗаполнения.Записать();
					Если ЭтоГруппа Тогда
						СоответствиеГрупп.Вставить(ПКС, ПКСДляЗаполнения.Ссылка);
					КонецЕсли;
				КонецЦикла;
				// Удаление лишних ПКС измененного элемента.
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	Ссылка
				|ИЗ Справочник.ПравилаКонвертацииСвойств
				|ГДЕ Владелец = &ИзмененноеПКО 
				|	И Ссылка НЕ В (&ОбновленныеПКС)";
				Запрос.УстановитьПараметр("ИзмененноеПКО", ОбъектДляОбработки);
				Запрос.УстановитьПараметр("ОбновленныеПКС", ОбновленныеПКС);
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					ПКСОбъект = Выборка.Ссылка.ПолучитьОбъект();
					ПКСОбъект.ОбменДанными.Загрузка = Истина;
					ПКСОбъект.Удалить();
				КонецЦикла;
			КонецЕсли; // Если ТипЗнч(ИсходныйОбъект) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
			// Удаление записи о захвате из регистра.
			ЗаписьОЗахвате = РегистрыСведений.СовместнаяРаботаСОбъектами.СоздатьНаборЗаписей();
			ЗаписьОЗахвате.Отбор.Объект.Установить(ОбъектДляОбработки);
			ЗаписьОЗахвате.Отбор.Действие.Установить(Перечисления.ДействияПриСовместнойРаботе.Захват);
			ЗаписьОЗахвате.Записать(Истина); 
			
			// Удаление исходной копии объекта.
			УдалитьЗаписьСоставКонвертации(ИсходныйОбъект.Ссылка);
			ИсходныйОбъект.ОбменДанными.Загрузка = Истина;
			ИсходныйОбъект.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта", Истина);
			ИсходныйОбъект.Удалить();
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ВыполненоУспешно = Ложь;
		ОтменитьТранзакцию();
		Если Действие = Перечисления.ДействияПриСовместнойРаботе.ОтменаЗахвата Тогда
			ТекстСообщения = НСтр("ru='Не удалось отменить захват объекта:'");
		Иначе
			ТекстСообщения = НСтр("ru='Не удалось записать изменения объекта:'");
		КонецЕсли;
		ТекстСообщения = ТекстСообщения + " " + ИсходныйОбъектСсылка + Символы.ПС + ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ОбъектДляОбработки);
	КонецПопытки;
КонецПроцедуры

// Проверяет наличие захвата объекта при изменении пометки на удаление правила конвертации или регистрации.
// Параметры:
//   Захвачен - Булево - Признак захвата объекта
//   ПометкаУдаления - Булево - Признак пометки на удаление объекта.
//   Отказ - Булево - признак отказа в выполнении операции.
Процедура ПроверитьЗахватОбъектаПриПометкеНаУдаление(Захвачен, ПометкаУдаления, Отказ) Экспорт
	Если Захвачен И Константы.СовместнаяРабота.Получить() Тогда
		Отказ = Истина;
		Если ПометкаУдаления Тогда
			ТекстСообщения = НСтр("ru='Объект захвачен. Пометка на удаление невозможна'");
		Иначе
			ТекстСообщения = НСтр("ru='Объект захвачен. Снятие пометки на удаление невозможно'");
		КонецЕсли;
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

// Выполняет захват объектов.
// Параметры:
//   СсылкиНаОбъект - СправочникСсылка - ссылка на элементы справочника, на которые накладывается захват
//   Пользователь - СправочникСсылка.Пользователи - пользователь который выполняет захват.
//   Комментарий - Строка - Описание внесенных изменений в случае сохранения изменений.
//   Отказ - Булево - признак отказа в выполнении операции.
Процедура ЗахватитьОбъекты(СсылкиНаОбъект, Пользователь, Комментарий, Отказ) Экспорт
	НачатьТранзакцию();
	Для Каждого ТекСсылка Из СсылкиНаОбъект Цикл
		СсылкаНаОбъект = ТекСсылка.Значение;
		
		// Получить состав конвертаций.
		СписокКонвертаций = Новый СписокЗначений;
		КонвертацияДанныхXDTOВызовСервера.ПолучитьВхожденияВКонвертацииДляЭлементаКонвертации(СсылкаНаОбъект, СписокКонвертаций);
		// Добавляем новый объект - копия существующего.
		ДубльОбъекта = СсылкаНаОбъект.Скопировать();
		ДубльОбъекта.Захвачен = Истина;
		ДубльОбъекта.Копия = Истина;
		ДубльОбъекта.ОбменДанными.Загрузка = Истина;
		ДубльОбъекта.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта", Истина);
		ДубльОбъекта.Записать();
		ДубльОбъектаСсылка = ДубльОбъекта.Ссылка;
		// Включение нового объекта в состав конвертации.
		КонвертацияДанныхXDTOВызовСервера.ЗаписатьЭлементКонвертацииВСоставКонвертации(ДубльОбъектаСсылка, СписокКонвертаций);
		// Добавление записи о захвате объекта.
		ПараметрыЗахвата = Новый Структура("Пользователь, Объект, Действие",
			Пользователь, СсылкаНаОбъект, Перечисления.ДействияПриСовместнойРаботе.Захват);
		ПараметрыЗахвата.Вставить("Комментарий", Комментарий);
		ПараметрыЗахвата.Вставить("РабочаяКопия", ДубльОбъектаСсылка);
		ДобавитьЗаписьЗахватОбъекта(ПараметрыЗахвата);
		
		МассивОбъектовДляЗахвата = ПолучитьОбъектыДляОбработкиПриЗахвате(СсылкаНаОбъект);
		СоответствиеГрупп = Новый Соответствие;
		Для НомерПрохода = 1 По 2 Цикл
			// В первый проход обрабатываются группы, во второй элементы.
			Для Каждого ПКС Из МассивОбъектовДляЗахвата Цикл
				Если ПКС = СсылкаНаОбъект Тогда
					Продолжить;
				КонецЕсли;
				ОбщиеДанныеПКС = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПКС, "ЭтоГруппа, ПометкаУдаления, Родитель");
				Если ОбщиеДанныеПКС.ПометкаУдаления Тогда
					Продолжить;
				КонецЕсли;
				Если НомерПрохода = 1 Тогда
					Если НЕ ОбщиеДанныеПКС.ЭтоГруппа Тогда
						Продолжить;
					КонецЕсли;
				ИначеЕсли НомерПрохода = 2 Тогда
					Если ОбщиеДанныеПКС.ЭтоГруппа Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;

				// Для ПКО подчиненные ПКС копируются.
				ДубльПКС = ПКС.Скопировать();
				ДубльПКС.Владелец = ДубльОбъектаСсылка;
				Если ЗначениеЗаполнено(ПКС.Родитель) Тогда
					ДубльПКС.Родитель = СоответствиеГрупп.Получить(ОбщиеДанныеПКС.Родитель);
				КонецЕсли;
				ДубльПКС.ОбменДанными.Загрузка = Истина;
				ДубльПКС.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта", Истина);
				ДубльПКС.Записать();
				Если ОбщиеДанныеПКС.ЭтоГруппа Тогда
					СоответствиеГрупп.Вставить(ПКС, ДубльПКС.Ссылка);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ЗахваченныйОбъект = СсылкаНаОбъект.ПолучитьОбъект();
		ЗахваченныйОбъект.ОбменДанными.Загрузка = Истина;
		ЗахваченныйОбъект.Захвачен = Истина;
		ЗахваченныйОбъект.ДополнительныеСвойства.Вставить("ПропуститьЗаписьВерсииОбъекта", Истина);
		ЗахваченныйОбъект.Записать();
	КонецЦикла;
	Попытка
		ЗафиксироватьТранзакцию();
	Исключение
		Отказ = Истина;
	КонецПопытки;
	СсылкаНаОбъект = Неопределено;

КонецПроцедуры

// Получает версию правила из хранилища значения.
// Параметры:
//   ДанныеХранилища - ХранилищеЗначения - сохраненная в регистре версия правила.
// Возвращаемое значение: Произвольный
Функция ПолучитьСериализованныеДанные(ДанныеХранилища) Экспорт
	Содержимое = ДанныеХранилища.Получить();
	Если ТипЗнч(Содержимое) = Тип("Структура") Тогда
		Результат = Новый Структура("ДанныеОбъекта", ПрочитатьДвоичныеДанные(Содержимое.ДанныеОбъекта));
		Результат.Вставить("ОтборПоСвойствамОбъекта", Содержимое.ОтборПоСвойствамОбъекта);
		Результат.Вставить("ОтборПоСвойствамПланаОбмена", Содержимое.ОтборПоСвойствамПланаОбмена);
		Возврат Результат;
	Иначе
		Возврат ПрочитатьДвоичныеДанные(Содержимое);
	КонецЕсли;
КонецФункции

// Добавляет запись в регистр сведений СовместнаяРаботаСОбъектами.
// Параметры:
//   ПараметрыЗахвата - Структура - Значения для заполнения измерений регистра сведений СовместнаяРаботаСОбъектами.
Процедура ДобавитьЗаписьЗахватОбъекта(ПараметрыЗахвата) Экспорт
	РегистрЗахватОбъектов = РегистрыСведений.СовместнаяРаботаСОбъектами.СоздатьМенеджерЗаписи();
	РегистрЗахватОбъектов.Активность = Истина;
	РегистрЗахватОбъектов.Период = ТекущаяДатаСеанса();
	ЗаполнитьЗначенияСвойств(РегистрЗахватОбъектов, ПараметрыЗахвата);
	РегистрЗахватОбъектов.Записать();
КонецПроцедуры

// Вызывается при записи нового объекта в случае использования механизма совместной работы.
// Фиксирует в регистре сведения о захвате нового объекта.
// Параметры:
//   СсылкаНового - СправочникСсылка - Объект подлежащий захвату. 
Процедура ОтразитьЗахватНовогоОбъекта(СсылкаНового) Экспорт
	ПараметрыЗахвата = Новый Структура("ДатаЗахвата, Пользователь, Объект",
		ТекущаяДатаСеанса(), Пользователи.ТекущийПользователь(), СсылкаНового);
	ПараметрыЗахвата.Вставить("Действие", Перечисления.ДействияПриСовместнойРаботе.Захват);
	ДобавитьЗаписьЗахватОбъекта(ПараметрыЗахвата);
КонецПроцедуры

// Точка входа для выполнения загрузки структуры метаданных регламентным заданием.
//
// Параметры:
//  УИДРелизаСтрокой - Строка - Уникальный идентификатор позиции справочника Релизы, для которого происходит загрузка.
//
Процедура ЗагрузитьСтруктуруМетаданныхПоРегламентномуЗаданию(УИДРелизаСтрокой) Экспорт
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ЗагрузкаМетаданных);

	Если Не ЗначениеЗаполнено(УИДРелизаСтрокой) Тогда
		ВызватьИсключение НСтр("ru = 'Не задан релиз.'");
	КонецЕсли;

	// Получение ссылки на релиз.
	Идентификатор = Новый УникальныйИдентификатор(УИДРелизаСтрокой);
	Релиз = Справочники.Релизы.ПолучитьСсылку(Идентификатор);
	Если НЕ ОбщегоНазначения.СсылкаСуществует(Релиз) Тогда
		ВызватьИсключение НСтр("ru = 'Не найден релиз.'");
	КонецЕсли;
	ДанныеРелиза = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Релиз, "ИсточникДанных, КаталогЗагрузки, РегламентноеЗаданиеGUID, ВариантЗагрузкиДвижений, ЕстьРасширения");
	Если ДанныеРелиза.ИсточникДанных = 1 Тогда
		Результат = Неопределено;
		Попытка
			Результат = ПолучитьФайлыИзGIT(Релиз);
		Исключение
			Результат = Неопределено;
		КонецПопытки;
		Если ЗначениеЗаполнено(Результат) И ТипЗнч(Результат) = Тип("Число") Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось выполнить клонирование ветки из GIT репозитория. Код ошибки:'") + Результат);
		КонецЕсли;
	КонецЕсли;
	ПараметрыЗагрузки = Новый Структура("СпособЗагрузки, Конфигурация, ЕстьРасширения", 1, Релиз, Ложь);
	УИДДляВременногоХраненияФайлов = Новый УникальныйИдентификатор();
	ИмяВременногоКаталогаФайлов = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(СокрЛП(КаталогВременныхФайлов()) + "_conf_" + Строка(Новый  УникальныйИдентификатор));
	СоздатьКаталог(ИмяВременногоКаталогаФайлов);
	ПомещенныеФайлыДляПередачи = Новый Массив;
	ПодготовитьФайлыДляЗагрузки(ПомещенныеФайлыДляПередачи, ДанныеРелиза.КаталогЗагрузки, ДанныеРелиза.ИсточникДанных = 1, Ложь, ИмяВременногоКаталогаФайлов);
	Если ДанныеРелиза.ЕстьРасширения Тогда
		КаталогиРасширений = Релиз.Расширения.Выгрузить().ВыгрузитьКолонку("ИмяКаталогаЗагрузки");
		Если КаталогиРасширений.Количество() > 0 Тогда
			ПараметрыЗагрузки.Вставить("КаталогиРасширений", КаталогиРасширений);
			ПараметрыЗагрузки.Вставить("ЕстьРасширения", Истина);
			Для Каждого КаталогРасш Из КаталогиРасширений Цикл
				ПодготовитьФайлыДляЗагрузки(ПомещенныеФайлыДляПередачи, КаталогРасш, ДанныеРелиза.ИсточникДанных = 1, Истина, ИмяВременногоКаталогаФайлов);
			Конеццикла;
		КонецЕсли;
	КонецЕсли;
	ПараметрыЗагрузки.Вставить("ПомещенныеФайлы", ПомещенныеФайлыДляПередачи);
	ПараметрыЗагрузки.Вставить("ТолькоОбновитьПланыОбмена", Ложь);
	ПараметрыЗагрузки.Вставить("ТолькоДобавлятьНовые", Ложь); 
	ПараметрыЗагрузки.Вставить("ИсточникДанных", ДанныеРелиза.ИсточникДанных);
	ПараметрыЗагрузки.Вставить("ВариантЗагрузкиДвижений", ДанныеРелиза.ВариантЗагрузкиДвижений);
	
	Обработки.ЗагрузкаСтруктурыКонфигурацииИзФайловXML.ВыполнитьЗагрузкуМетаданных(ПараметрыЗагрузки,Неопределено);
КонецПроцедуры

// Получает сведения о наличии доступа к объекту у пользователя.
// При необходимости устанавливает признак только просмотра у формы.
// Параметры:
//  ФормаСправочника - Форма - Открываемая форма правила.
//  СписокКонвертаций - СписокЗначений - Конвертации, к которым принадлежит правило.
Процедура ПроверитьДоступКОбъектуНаУровнеЗаписей(ФормаСправочника, СписокКонвертаций) Экспорт
	Если Пользователи.ЭтоПолноправныйПользователь( , , Ложь) Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 1
	|ИЗ РегистрСведений.НастройкиОграниченияДоступаККонвертациям
	|ГДЕ Пользователь = &ТекущийПользователь И Конвертация В (&СписокКонвертаций)";
	Запрос.УстановитьПараметр("ТекущийПользователь", Пользователи.АвторизованныйПользователь());
	Запрос.УстановитьПараметр("СписокКонвертаций", СписокКонвертаций);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ФормаСправочника.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

// Возвращает струкруту тегов для обрамления правил в модуле менеджера объекта метаданных.
// Возвращаемое значение: Структура
Функция ТегиДляМодуляМенеджераОбъекта() Экспорт 
	Возврат Новый Структура("ТегОткрытие, ТегЗакрытие", 
		"#Область ОбменДанными_СинхронизацияДанныхЧерезУниверсальныйФормат",
		"#КонецОбласти");
КонецФункции

// Возвращает наименование модуля по умолчанию, в который будет выгружено правило.
Функция ОпределитьМодульПравилаПоУмолчанию(Конвертация, ОбъектКонфигурации, ОбъектФормата, НаименованиеПравила, ИспользоватьДляОтправки, ИспользоватьДляПолучения) Экспорт
	ЭтоДокумент = Неопределено;
	Если ЗначениеЗаполнено(ОбъектКонфигурации) И ТипЗнч(ОбъектКонфигурации) = Тип("СправочникСсылка.Объекты") Тогда
		ТипОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектКонфигурации, "Тип");
		ЭтоДокумент = (ТипОбъекта = Перечисления.ТипыОбъектов.Документ);
	ИначеЕсли ЗначениеЗаполнено(ОбъектФормата) Тогда
		ЭтоДокумент = (СтрНайти(ОбъектФормата, "Документ.") > 0);
	Иначе
		ЭтоДокумент = (СтрНайти(НаименованиеПравила, "Документ") > 0);
	КонецЕсли;
	Если ЭтоДокумент Тогда
		Раздел = ?(ИспользоватьДляОтправки, Перечисления.РазделыДополнительныхМодулей.ДокументыОтправка, Перечисления.РазделыДополнительныхМодулей.ДокументыПолучение); 
	Иначе
		Раздел = ?(ИспользоватьДляОтправки, Перечисления.РазделыДополнительныхМодулей.ПрочееОтправка, Перечисления.РазделыДополнительныхМодулей.ПрочееПолучение); 
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Наименование
	|ИЗ Справочник.ДополнительныеМодули
	|ГДЕ Владелец = &Конвертация И Раздел = &Раздел";
	Запрос.УстановитьПараметр("Конвертация", Конвертация);
	Запрос.УстановитьПараметр("Раздел", Раздел);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекстПодсказки = НСтр("ru='Выгружается в общий модуль %ИмяМодуля%'");
		Возврат СтрЗаменить(ТекстПодсказки, "%ИмяМодуля%", СокрЛП(Выборка.Наименование));
	КонецЕсли;  
	Возврат НСтр("ru='Не удалось определить предопределенный модуль для выгрузки'");
КонецФункции

Функция ПолучитьТабличныйДокументПКСДляВерсииОбъекта(ПКОСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Родитель,
	|	ЭтоГруппа,
	|	СвойствоКонфигурации,
	|	СвойствоФормата,
	|	СвойствоКонфигурацииКорреспондента,
	|	Отключить,
	|	Комментарий,
	|	ПравилоКонвертацииСвойства,
	|	ИспользуетсяАлгоритмКонвертации,
	|	ТипСвойстваКонфигурации
	|ИЗ Справочник.ПравилаКонвертацииСвойств
	|ГДЕ Владелец = &ПКО
	|УПОРЯДОЧИТЬ ПО Код, Наименование";
	Запрос.УстановитьПараметр("ПКО", ПКОСсылка);
	ТабРез = Запрос.Выполнить().Выгрузить();
	ТабДок = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабРез);
	Построитель.Вывести(ТабДок);
	Возврат ТабДок;
КонецФункции
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Процедура ДлинаБезДесятых(ПредставлениеТипа, Длина)
	Длина = 0;
	ПозицияСкобки1 = Найти(ПредставлениеТипа, "(");
	ПозицияСкобки2 = Найти(ПредставлениеТипа, ")");
	Если ПозицияСкобки1 > 0 И ПозицияСкобки2 > 0 Тогда
		ДлинаСтрокой = Сред(ПредставлениеТипа, ПозицияСкобки1 + 1, ПозицияСкобки2 - ПозицияСкобки1 - 1);
		Длина = Число(ДлинаСтрокой);
	КонецЕсли;
КонецПроцедуры


Функция ПрочитатьДвоичныеДанные(ДвоичныеДанные)
	ЧтениеFastInfoSet = Новый ЧтениеFastInfoSet;
	ЧтениеFastInfoSet.УстановитьДвоичныеДанные(ДвоичныеДанные);
	Возврат ПрочитатьXML(ЧтениеFastInfoSet); 
КонецФункции

Процедура ПолучитьТЧИСвойстваИсключаемые(ЗахваченныйЭлемент, СвойстваИсключаемые, СвойстваСтрокой, МассивТЧ)
	// Массив ТЧ заполняется по простому на основе анализа типов справочников.
	Если ТипЗнч(ЗахваченныйЭлемент) = Тип("СправочникСсылка.ПравилаКонвертацииПредопределенныхДанных") Тогда
		МассивТЧ.Добавить("СопоставлениеЗначений");
	ИначеЕсли ТипЗнч(ЗахваченныйЭлемент) = Тип("СправочникСсылка.ПравилаОбработкиДанных") Тогда
		МассивТЧ.Добавить("ПравилаКонвертацииОбъектов");
	ИначеЕсли ТипЗнч(ЗахваченныйЭлемент) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
		МассивТЧ.Добавить("ИдентификацияПоПолямПоиска");
		МассивТЧ.Добавить("НастройкаВариантовПоискаОбъектовXML");
	КонецЕсли;
	НастройкиИсключенияСвойств = СвойстваИсключаемые.Получить(ТипЗнч(ЗахваченныйЭлемент));
	Если ТипЗнч(НастройкиИсключенияСвойств) = Тип("Структура") Тогда
		СвойстваСтрокой = "";
		Если ЗахваченныйЭлемент.ЭтоГруппа Тогда
			СвойстваСтрокой = НастройкиИсключенияСвойств.Группа;
		Иначе
			СвойстваСтрокой = НастройкиИсключенияСвойств.Элемент;
		КонецЕсли;
		Если ЗначениеЗаполнено(СвойстваСтрокой) Тогда
			Возврат;
		КонецЕсли;
	Иначе
		НастройкиИсключенияСвойств = Новый Структура("Группа, Элемент","","");
	КонецЕсли;
	МетаданныеОбъекта = ЗахваченныйЭлемент.Метаданные();
	СписокСвойств = Новый Массив;
	Если НЕ МетаданныеОбъекта.Иерархический Тогда
		СписокСвойств.Добавить("Родитель");
		СписокСвойств.Добавить("ЭтоГруппа");
	КонецЕсли;
	Если МетаданныеОбъекта.Владельцы.Количество() = 0 Тогда
		СписокСвойств.Добавить("Владелец");
	КонецЕсли;
	// При копировании коды не сохраняются.
	СписокСвойств.Добавить("Код");
	Если МетаданныеОбъекта.ДлинаНаименования = 0 Тогда
		СписокСвойств.Добавить("Наименование");
	КонецЕсли;
	СписокСвойств.Добавить("Ссылка");
		
	// Добавляем свойства, которые предназначены только для группы или только для элемента.
	Если МетаданныеОбъекта.Иерархический Тогда
		Для Каждого МетаРеквизит Из МетаданныеОбъекта.Реквизиты Цикл
			Если (МетаРеквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы
				И НЕ ЗахваченныйЭлемент.ЭтоГруппа)
				ИЛИ (МетаРеквизит.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента
				И ЗахваченныйЭлемент.ЭтоГруппа) Тогда
				СписокСвойств.Добавить(МетаРеквизит.Имя);
			КонецЕсли;
		КонецЦикла;
		Для Каждого МетаТЧ Из МетаданныеОбъекта.ТабличныеЧасти Цикл
			Если (МетаТЧ.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы
				И НЕ ЗахваченныйЭлемент.ЭтоГруппа)
				ИЛИ (МетаТЧ.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента
				И ЗахваченныйЭлемент.ЭтоГруппа) Тогда
				СписокСвойств.Добавить(МетаТЧ.Имя);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	СвойстваСтрокой = СтрСоединить(СписокСвойств,",");
	Если ЗахваченныйЭлемент.ЭтоГруппа Тогда
		НастройкиИсключенияСвойств.Группа = СвойстваСтрокой;
	Иначе
		НастройкиИсключенияСвойств.Элемент = СвойстваСтрокой;
	КонецЕсли;
		
	СвойстваИсключаемые.Вставить(ТипЗнч(ЗахваченныйЭлемент), НастройкиИсключенияСвойств);
КонецПроцедуры

Функция ПолучитьОбъектыДляОбработкиПриЗахвате(СсылкаНаОбъект)
	ОбъектыКОбработке = Новый Массив;
	ОбъектыКОбработке.Добавить(СсылкаНаОбъект);
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.ПравилаКонвертацииОбъектов") Тогда
		// Правила конвертации свойств тоже надо поместить в регистр.
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Ссылка
		|ИЗ Справочник.ПравилаКонвертацииСвойств
		|ГДЕ Владелец = &СсылкаНаОбъект";
		Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбъектыКОбработке.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	Возврат ОбъектыКОбработке;
КонецФункции

// Получает версии файлов из репозитория
//
// Параметры:
//  Параметры - Релиз - СправочникСсылка.Релизы
//
Функция ПолучитьФайлыИзGIT(Релиз) Экспорт
	Параметры = Новый Структура;
	РеквизитыПроекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Релиз, "АдресGitСервера, КаталогGitРепозитория, ИмяВеткиРепозитория");
	
	АдресGitСервера = РеквизитыПроекта.АдресGitСервера;
	КаталогGitРепозитория = РеквизитыПроекта.КаталогGitРепозитория;
	ИмяВеткиРепозитория = РеквизитыПроекта.ИмяВеткиРепозитория;
	ИмяБазовойВетки = "";
	Если НЕ ЗначениеЗаполнено(АдресGitСервера) ИЛИ НЕ ЗначениеЗаполнено(ИмяВеткиРепозитория) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СоздатьВремКаталог = Ложь;
	Если НЕ ЗначениеЗаполнено(КаталогGitРепозитория) Тогда
		СоздатьВремКаталог = Истина;
	КонецЕсли;
	
	Если СоздатьВремКаталог Тогда
		КаталогGitРепозитория = ПолучитьИмяВременногоФайла() 
	                 + ПолучитьРазделительПути() 
	                 + Строка(Новый УникальныйИдентификатор);
		СоздатьКаталог(КаталогGitРепозитория);
	КонецЕсли;
	
	Параметры.Вставить("КаталогGitРепозитория", КаталогGitРепозитория);
	
	ФайлКоманды = Новый ТекстовыйДокумент;
	ФайлЛогаТекстДокумент = Новый ТекстовыйДокумент;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ЭтоWindowsСервер = (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86
		Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64);
	
	Если ЭтоWindowsСервер Тогда
		ТекстКоманды = "@ECHO OFF";
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	Иначе
		ТекстКоманды = "#!/bin/bash";
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	КонецЕсли;
	
	ФайлЛога = ПолучитьИмяВременногоФайла("txt");
	ФайлКомандыGit = ПолучитьИмяВременногоФайла(?(ЭтоWindowsСервер, ".bat", ".sh"));
	
	ТекстКоманды = "git config --get remote.origin.url >> ""%LOGFILE%""";
	ТекстКоманды = СтрЗаменить(ТекстКоманды, "%LOGFILE%", ФайлЛога);
	ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	
	Если ЭтоWindowsСервер Тогда
		ФайлКоманды.Записать(ФайлКомандыGit, КодировкаТекста.OEM);
	Иначе
		ФайлКоманды.Записать(ФайлКомандыGit, КодировкаТекста.Системная);
	КонецЕсли;
	
	КодВозврата = 0;
	ЗапуститьПриложение(?(ЭтоWindowsСервер, "", "bash ") + ФайлКомандыGit, КаталогGitРепозитория, Истина, КодВозврата);
	
	Если КодВозврата <> 0 И КодВозврата <> 1 Тогда
		Возврат КодВозврата;
	КонецЕсли;
	
	Файл = Новый Файл(ФайлЛога);
	Если Файл.Существует() Тогда
		ФайлЛогаТекстДокумент.Прочитать(ФайлЛога);
	Иначе
		Возврат 1;
	КонецЕсли;
	АдресGitСервераНаСервере = ФайлЛогаТекстДокумент.ПолучитьСтроку(1);
	
	ФайлКоманды = Новый ТекстовыйДокумент;
	ФайлЛогаТекстДокумент = Новый ТекстовыйДокумент;
	
	Попытка
		УдалитьФайлы(ФайлКомандыGit);
		УдалитьФайлы(ФайлЛога);
	Исключение
		ФайлКомандыGit = "";
	КонецПопытки;
	
	
	ФайлЛога = ПолучитьИмяВременногоФайла("txt");
	ФайлКомандыGit = ПолучитьИмяВременногоФайла(?(ЭтоWindowsСервер, ".bat", ".sh"));
	
	Если ЭтоWindowsСервер Тогда
		ТекстКоманды = "@ECHO OFF";
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	Иначе
		ТекстКоманды = "#!/bin/bash";
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресGitСервераНаСервере) И АдресGitСервера = АдресGitСервераНаСервере Тогда
		
		ТекстКоманды = "git pull >> ""%LOGFILE%""";
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%LOGFILE%", ФайлЛога);
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
		
	Иначе
		
		Попытка
			УдалитьФайлы(КаталогGitРепозитория, "*");
		Исключение
			КаталогGitРепозитория = "";
		КонецПопытки;
		
		// Skip smudge - We'll download binary files later in a faster batch
		ТекстКоманды = "git lfs install --skip-smudge";
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
		
		ТекстКоманды = "git clone -b ""%BRANCH%"" ""%GITSERVER%"" ""%FILE%"" >> ""%LOGFILE%""";
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%BRANCH%", ИмяВеткиРепозитория);
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%GITSERVER%", АдресGitСервера);
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%FILE%", КаталогGitРепозитория);
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%LOGFILE%", ФайлЛога);
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);

		ТекстКоманды = "cd ""%FILE%""";
		ТекстКоманды = СтрЗаменить(ТекстКоманды, "%FILE%", КаталогGitРепозитория);
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
		
		// Fetch all the binary files in the new clone
		ТекстКоманды = "git lfs pull";
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
		
		// Reinstate smudge
		ТекстКоманды = "git lfs install --force";
		ФайлКоманды.ДобавитьСтроку(ТекстКоманды);
		
	КонецЕсли;
	
	Если ЭтоWindowsСервер Тогда
		ФайлКоманды.Записать(ФайлКомандыGit, КодировкаТекста.OEM);
	Иначе
		ФайлКоманды.Записать(ФайлКомандыGit, КодировкаТекста.Системная);
	КонецЕсли;
	
	КодВозврата = 0;
	ЗапуститьПриложение(?(ЭтоWindowsСервер, "", "bash ") + ФайлКомандыGit, КаталогGitРепозитория, Истина, КодВозврата);
	Если КодВозврата <> 0 Тогда
		Возврат КодВозврата;
	КонецЕсли;
	Файл = Новый Файл(ФайлЛога);
	Если Файл.Существует() Тогда
		ФайлЛогаТекстДокумент.Прочитать(ФайлЛога);
		РезультатКоманды = ФайлЛогаТекстДокумент.ПолучитьСтроку(1);
	КонецЕсли;
	Попытка
		УдалитьФайлы(ФайлЛога);
		УдалитьФайлы(ФайлКомандыGit);
	Исключение
		ФайлЛога = "";
	КонецПопытки;
	Возврат РезультатКоманды;
КонецФункции

Процедура УдалитьЗаписьСоставКонвертации(ЭлементКонвертации) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка
	|ИЗ Справочник.СоставыКонвертаций
	|ГДЕ ЭлементКонвертации = &ЭлементКонвертации";
	Запрос.УстановитьПараметр("ЭлементКонвертации", ЭлементКонвертации);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.Удалить();
	КонецЦикла;
КонецПроцедуры

Процедура ПодготовитьФайлыДляЗагрузки(ФайлыДляЗагрузки, КаталогЗагрузки, ЗагрузкаИзEDT, ЭтоРасширение, ИмяВременногоКаталогаФайлов)
	КаталогиДляОбработки = Новый Массив;
	КаталогиДляОбработки.Добавить("Catalogs");
	КаталогиДляОбработки.Добавить("Documents");
	КаталогиДляОбработки.Добавить("Enums");
	КаталогиДляОбработки.Добавить("Tasks");
	КаталогиДляОбработки.Добавить("BusinessProcesses");
	КаталогиДляОбработки.Добавить("ChartsOfAccounts");
	КаталогиДляОбработки.Добавить("ChartsOfCalculationTypes");
	КаталогиДляОбработки.Добавить("ChartsOfCharacteristicTypes");
	КаталогиДляОбработки.Добавить("AccountingRegisters");
	КаталогиДляОбработки.Добавить("AccumulationRegisters");
	КаталогиДляОбработки.Добавить("CalculationRegisters");
	КаталогиДляОбработки.Добавить("InformationRegisters");
	КаталогиДляОбработки.Добавить("ExchangePlans");
	КаталогиДляОбработки.Добавить("EventSubscriptions");
	КаталогиДляОбработки.Добавить("Constants");
	КаталогиДляОбработки.Добавить("DefinedTypes");
	Если ЗагрузкаИзEDT Тогда
		КаталогиДляОбработки.Добавить("Configuration");
	КонецЕсли;
	Если ЗагрузкаИзEDT Тогда
		НайдФайлы = НайтиФайлы(КаталогЗагрузки,".project",Ложь);
	Иначе
		НайдФайлы = НайтиФайлы(КаталогЗагрузки,"Configuration.xml",Ложь);
	КонецЕсли;
	ОбработатьНайденныеФайлы(НайдФайлы, ФайлыДляЗагрузки, ЭтоРасширение, ИмяВременногоКаталогаФайлов);
	Для Каждого ИмяКаталога Из КаталогиДляОбработки Цикл
		Если НЕ ЗагрузкаИзEDT Тогда
			НайдФайлы = НайтиФайлы(КаталогЗагрузки + "/" + ИмяКаталога,"*.xml",Ложь);
			ОбработатьНайденныеФайлы(НайдФайлы, ФайлыДляЗагрузки, ЭтоРасширение, ИмяВременногоКаталогаФайлов);
			Если ИмяКаталога = "ExchangePlans" Тогда
				// Файлы с составом плана обмена.
				НайдФайлы = НайтиФайлы(КаталогЗагрузки + "/" + ИмяКаталога,"Content.xml",Истина);
			Иначе
				НайдФайлы = НайтиФайлы(КаталогЗагрузки + "/" + ИмяКаталога,"Predefined.xml",Истина);
			КонецЕсли;
			ОбработатьНайденныеФайлы(НайдФайлы, ФайлыДляЗагрузки, ЭтоРасширение, ИмяВременногоКаталогаФайлов);
		Иначе
			НайдФайлы = НайтиФайлы(КаталогЗагрузки + "/src/" + ИмяКаталога,"*.mdo",Истина);
			ОбработатьНайденныеФайлы(НайдФайлы, ФайлыДляЗагрузки, ЭтоРасширение, ИмяВременногоКаталогаФайлов);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьНайденныеФайлы(НайдФайлы, ФайлыДляЗагрузки, ЭтоРасширение, ИмяВременногоКаталогаФайлов)
	Если НайдФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Для Каждого ВложенныйФайл Из НайдФайлы Цикл
		Если ВложенныйФайл.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		ИмяФайлаСведений = ИмяВременногоКаталогаФайлов + Строка(Новый  УникальныйИдентификатор)+ ".xml";
		ДвоичныеДанные = Новый ДвоичныеДанные(ВложенныйФайл.ПолноеИмя);
		ДвоичныеДанные.Записать(ИмяФайлаСведений);
		ПараметрыФайла = Новый Структура("ПолноеИмя, Хранение, ЭтоРасширение", ВложенныйФайл.ПолноеИмя, ИмяФайлаСведений, ЭтоРасширение);
		ФайлыДляЗагрузки.Добавить(ПараметрыФайла);
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
